base_image:
  image: nvcr.io/nvidia/nemo:23.03
  python_executable_path: /usr/bin/python
bundled_packages_dir: packages
data_dir: data
description: null
environment_variables: {}
examples_filename: examples.yaml
external_package_dirs: []
input_type: Any
live_reload: false
model_class_filename: model.py
model_class_name: Model
model_framework: custom
model_metadata:
  example_model_input: {"prompt": "# Write a python function that prints hello world\n", "do_sample": True, "max_new_tokens": 300}
  # avatar_url: https://cdn.baseten.co/production/static/explore/wizard.png
  # cover_image_url: https://cdn.baseten.co/production/static/explore/wizardlm.png
  tags:
  - code-generation
model_module_dir: model
model_name: null
model_type: custom
python_version: py311
# hf_cache:
#   repo_id: replit/replit-code-v1-3b
requirements:
- flash-attn==0.2.8
- triton==2.0.0.dev20221202
- transformers
- sentencepiece
- einops
resources:
  cpu: "3"
  memory: 14Gi
  use_gpu: true
  accelerator: A10G
secrets: {}
spec_version: '2.0'
system_packages: []
